{
  "featured": [
    {
      "id": "deep-dive-unveiling-kesi-android",
      "img": "deep-dive-unveiling-kesi-android.jpg",
      "type": "Article",
      "title": "Deep Dive: Unveiling Kesi Android",
      "description": "Welcome to the very first deep dive on this blog! Today, we're not just skimming the surface. We're jumping headfirst into the intricate world of Android development by dissecting a complete application: **Kesi Android**. Ever wondered what truly goes into building a robust, maintainable, and well-structured Android application? Beyond the UI and features, there's a hidden world of architectural decisions, best practices, and foundational setup that can make or break a project. This series is all about uncovering that world."
    },
    {
      "id": "kesi-android-multi-module",
      "img": "kesi-android-multi-module.jpg",
      "type": "Article",
      "title": "Kesi Android Multi-Module Architecture",
      "description": "In this post, I'll walk you through how Kesi Android divided its codebase into distinct modules to achieve a multi-module architecture. I'll explain the reasoning behind each module, and discuss how this approach helps us adhere to SOLID principles and significantly enhances project scalability."
    },
    {
      "id": "gradle-convention-plugins",
      "img": "gradle-convention-plugins.jpg",
      "type": "Article",
      "title": "Gradle convention plugins in Kesi Android",
      "description": "Ah, Gradle. The powerful, flexible, and sometimes overwhelmingly complex build system that powers our Android projects. If you've ever found yourself endlessly copying and pasting configurations across `build.gradle.kts` files, battling inconsistencies between modules, or dreading the thought of updating a common dependency everywhere, then this post is for you. This was certainly our reality at Kesi Android before we embraced a more structured approach."
    }
  ],
  "promotedContent": [
    {
      "category": {
        "id": "category_A",
        "name": "Category A"
      },
      "promotedContent": [
        {
          "id": "getting_started_with_hilt",
          "img": "debugging_jetpack_compose_img.jpg",
          "type": "Article",
          "title": "Promoted Item A1 Title",
          "description": "Description for promoted item A1."
        }
      ]
    },
    {
      "category": {
        "id": "category_B",
        "name": "Category B"
      },
      "promotedContent": [
        {
          "id": "promo_B_2",
          "img": "debugging_jetpack_compose_img.jpg",
          "type": "Video",
          "title": "Promoted Item B2 Title",
          "description": "Description for promoted item B2."
        }
      ]
    }
  ]
}
